simulations/icofoam_cases/3_branch_shifted_bed/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    main_inlet
    {
        type            fixedValue;
        value		uniform (-5.1816 0 0);
    }
    main_outlet
    {
        type            zeroGradient;
    }
    branch_inlet
    {
        type            fixedValue;
        value		uniform (0 0 -5.1816);
    }
    branch_outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            noSlip;
    }
    surface
    {
        type            noSlip;
    }
}

// ************************************************************************* //
